### Prepping Data Challenge: Setting Grades (Week 5)

This week's challenge is looking to take the numeric score our students' have received and turn it to:

 - A letter grade (our students' parents prefer this) 
 - A score that goes towards their High School applications
The challenge's aim is understand how many points on average a student who receives an A gets. This will help us understand how many students would get a higher score than the average student receiving an A without receiving one. 

### Input

One file (the same Grades as 2022 Week 3) of grades by student and subject.

### Requirements
 - Input the data
 - Divide the students grades into 6 evenly distributed groups 
   - By evenly distributed, it means the same number of students gain each grade within a subject
 - Convert the groups to two different metrics:
   - The top scoring group should get an A, second group B etc through to the sixth group who receive an F
   - An A is worth 10 points for their high school application, B gets 8, C gets 6, D gets 4, E gets 2 and F gets 1.
 - Determine how many high school application points each Student has received across all their subjects 
 - Work out the average total points per student by grade 
   - ie for all the students who got an A, how many points did they get across all their subjects
 - Take the average total score you get for students who have received at least one A and remove anyone who scored less than this. 
 - Remove students who received an A
 - How many students scored more than the average and never received an A?
 - Output the data

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
# Input the data.
df = pd.read_csv('WK3- Grades input.csv')

In [3]:
df.head()

   Student ID  Maths  English  Spanish  Science  Art  History  Geography
0           1     66       97       85       75   76       94         76
1           2     84       85       62       87   68       75         74
2           3     88       68       69       81   92       89         75
3           4     65       97       96       89   98       77         62
4           5     86       97       94       98   67       77         97

In [4]:
#Divide the students grades into 6 evenly distributed groups 
#By evenly distributed, it means the same number of students gain each grade within a subject
df2 = pd.melt(df, id_vars=['Student ID'], var_name = 'Subject',value_name='Score')

In [5]:
df2.head()

   Student ID Subject  Score
0           1   Maths     66
1           2   Maths     84
2           3   Maths     88
3           4   Maths     65
4           5   Maths     86

In [6]:
label = ['F', 'E', 'D', 'C', 'B', 'A']
df2['Grade'] = pd.cut(df2['Score'], bins=6, labels=label)

In [7]:
df2.head(10)

   Student ID Subject  Score Grade
0           1   Maths     66     F
1           2   Maths     84     C
2           3   Maths     88     B
3           4   Maths     65     F
4           5   Maths     86     C
5           6   Maths     80     D
6           7   Maths     68     E
7           8   Maths     82     C
8           9   Maths    100     A
9          10   Maths     81     C

In [8]:
#An A is worth 10 points for their high school application, B gets 8, C gets 6, D gets 4, E gets 2 and F gets 1.
points = {'A' : 10, 'B' : 8,'C' : 6, 'D' : 4, 'E' : 2, 'F' : 1}
df2['Points'] = df2['Grade'].map(points)

In [9]:
df2['Points'].dtypes

CategoricalDtype(categories=[1, 2, 4, 6, 8, 10], ordered=True)

In [10]:
df2['Points'] = df2['Points'].astype('int64')

In [11]:
#Determine how many high school application points each Student has received across all their subjects 
df2['Total Point per Student'] = df2.groupby(['Student ID'])['Points'].transform('sum')

In [12]:
df2.head()

   Student ID Subject  Score Grade  Points  Total Point per Student
0           1   Maths     66     F       1                       39
1           2   Maths     84     C       6                       31
2           3   Maths     88     B       8                       38
3           4   Maths     65     F       1                       44
4           5   Maths     86     C       6                       52

In [13]:
#Work out the average total points per student by grade 
#ie for all the students who got an A, how many points did they get across all their subjects
df2['Avg points'] = df2.groupby(['Student ID'])['Points'].transform('mean')

In [90]:
#Take the average total score you get for students who have received at least one A 
#and remove anyone who scored less than this.

,Student ID,Subject,Score,Grade,Points,Total Points per Student,Avg Student total point per grade,avg score,avg
0,1,Maths,66,F,1,39,5.571429,569,14.589744
1,2,Maths,84,C,6,31,4.428571,535,17.258065
2,3,Maths,88,B,8,38,5.428571,562,14.789474
3,4,Maths,65,F,1,44,6.285714,584,13.272727
4,5,Maths,86,C,6,52,7.428571,616,11.846154

In [89]:
#df2['Avg Total Score'] = df2.assign(result = np.where(df['Grade']=='A'))\
#   .groupby('Score').agg({'result':sum})

In [15]:
#Remove students who received an A
df2 = df2[df2['Grade'] != 'A']

In [16]:
df2.head()

,Student ID,Subject,Score,Grade,Points,Total Point per Student,Avg points
0,1,Maths,66,F,1,39,5.571429
1,2,Maths,84,C,6,31,4.428571
2,3,Maths,88,B,8,38,5.428571
3,4,Maths,65,F,1,44,6.285714
4,5,Maths,86,C,6,52,7.428571

In [ ]:
#How many students scored more than the average and never received an A?

In [ ]:
df2.to_csv('wk5-output.csv')